var num1; 
var num2;
var xueyuan=["商学院","法学院","教师教育学院","体育学院","人文与传媒学院","外国语学院","潘天寿艺术设计学院","音乐学院","理学院",
	"材料科学与化学工程学院","信息科学与工程学院","机械工程与力学学院"];
var zhuanye=[
	["国际经济与贸易系","金融系","经济系","工商管理系","会计系","信息管理系"],
	["法学系","公共管理系","政治学系","思想政治理论教学部"],
	["教育技术学系","教育学系","心理学系","小学教育系","学前教育系","公共理论部"],
	["体育学系","运动系","公共体育部、竞赛训练部"],
	["中文系","历史系","传播系"],
	["英语系","日语系","大学英语教学部","德语系"],
	["家电设计系","家具设计系","家纺设计系","家园设计系","美术系"],
	["音乐学系","音乐教育部","音乐表演系","美育中心","音乐研究所"],
	["数学系","高等数学教学部","物理系","大学物理教学部"],
	["高分子科学与工程系","化学系","应用化学系"],
	["通信工程系","电子信息科学与技术系","计算机科学与技术西系","电气工程与自动化系"],
	["力学与工程科学系","机械工程系","工业工程系","车辆工程系"],
	];
//var countires=[[["龙湖区","新郑区"],["金明区","南关区"],["老城","洛龙"],["商水","周口"]],[["迎泽区","万柏林区","小店区","杏花岭区"],["城区","矿区"],["南边区","小北沟"]],[["莱山区","福山区","芝罘区"],["市南","市北"],["市中区","天桥区"],["文登市","乳山市"]]];
$(function(){
    for(var i=0;i<xueyuan.length;i++){
    $("#SD").append("<option "+"value="+xueyuan[i]+">"+xueyuan[i]+"</option>");
    }
    $("#SD").change(function(){
        $("#SZ").children().not(":eq(0)").remove();
        num1=$(this).children("option:selected").index();
        var acity1=zhuanye[num1-1];
        for(var j=0;j<acity1.length;j++){
        $("#SZ").append("<option "+"value="+acity1[j]+">"+acity1[j]+"</option>");
        }
    /*$("#SZ").change(function(){
        $("#SC").children().not(":eq(0)").remove();
        num2=$(this).children("option:selected").index();
        var contries1=countires[num1-1][num2-1];
        for( var z=0;z<contries1.length;z++){
        $("#SC").append("<option>"+contries1[z]+"</option>");
        }
        });*/
        });
    });